{"subject_name":"Enviromental Science","subject_id":41,"chapters":[{"chapter_name":"04.Atmosphere","topics":[{"topic_name":"01.Evolution","topic_html":"<sn><im>https://www.worldatlas.com/r/w1200/upload/64/c7/2c/shutterstock-527285524.jpg</im><md data-rr=\"true\"><pre>### Early Atmosphere: Primordial Gases and Volcanic Activity<br>- **Formation**: Earth's first atmosphere likely emerged about 4.6 billion years ago, during the planet's formation.<br>- **Composition**: The early atmosphere was mostly hydrogen and helium, with minor methane and ammonia.<br>- **Loss of Primordial Gases**: Solar winds stripped away these gases due to the absence of a magnetic field.<br><br>---<br><br>### Second Atmosphere: Volcanic Outgassing<br>- **Timeframe**: Around 4 billion years ago, Earth’s volcanic activity released gases, forming a secondary atmosphere.<br>- **Composition**: Dominated by carbon dioxide (CO₂), water vapor (H₂O), nitrogen (N₂), and traces of sulfur dioxide (SO₂) and ammonia (NH₃).<br>- **Ocean Formation**: Cooling led to water vapor condensation, forming oceans that helped absorb CO₂ from the atmosphere.<br><br>---<br><br>### Emergence of Life and Oxygenation<br>- **Photosynthetic Microorganisms**: About 3 billion years ago, cyanobacteria began photosynthesizing, releasing oxygen.<br>- **Great Oxidation Event (GOE)**: Around 2.4 billion years ago, oxygen levels rose significantly, reacting with iron in oceans to form iron oxides, laying down large iron deposits.<br>- **Result**: The atmosphere shifted from a reducing environment to an oxidizing one, enabling more complex aerobic life forms.<br><br>---<br><br>### Stabilization and Modern Atmosphere<br>- **Oxygen-Nitrogen Dominance**: By around 500 million years ago, atmospheric oxygen levels stabilized, creating conditions suitable for multicellular organisms.<br>- **Ozone Layer Formation**: Increasing oxygen led to ozone (O₃) formation, protecting the Earth from harmful UV radiation and enabling terrestrial life.<br>- **Present Composition**: Nitrogen (~78%), Oxygen (~21%), with trace amounts of argon, CO₂, and other gases.<br><br>---<br><br>This evolutionary journey illustrates how Earth's atmosphere developed through stages, transforming into a life-sustaining environment.</pre></md></sn><sn><md data-rr=\"true\"><pre>Here's a table summarizing the evolution of Earth's atmosphere for clarity:<br><br>| **Period**                     | **Timeframe**              | **Main Characteristics**                                                                                                                                               |<br>|--------------------------------|----------------------------|------------------------------------------------------------------------------------------------------------------------------------------------------------------------|<br>| **Primordial Atmosphere**      | ~4.6 billion years ago     | - Composed mostly of hydrogen and helium, with some methane and ammonia. &lt;br&gt; - Solar winds stripped away these gases due to the lack of a magnetic field.            |<br>| **Volcanic Outgassing**        | ~4 billion years ago       | - Volcanic eruptions released gases, forming a secondary atmosphere. &lt;br&gt; - Dominated by CO₂, H₂O, and N₂, with traces of SO₂ and NH₃. &lt;br&gt; - Oceans began forming.   |<br>| **Emergence of Life**          | ~3 billion years ago       | - Cyanobacteria started photosynthesis, producing oxygen.                                                                                                              |<br>| **Great Oxidation Event (GOE)**| ~2.4 billion years ago     | - Significant rise in oxygen levels, reacting with iron to form iron oxide deposits. &lt;br&gt; - Shift from reducing to oxidizing environment.                             |<br>| **Oxygen Stabilization**       | ~500 million years ago     | - Oxygen and nitrogen levels stabilized, forming an oxygen-rich atmosphere. &lt;br&gt; - Ozone layer began forming, allowing life to expand on land.                        |<br>| **Modern Atmosphere**          | Present day                | - Composition: ~78% Nitrogen, ~21% Oxygen, with trace gases like argon and CO₂. &lt;br&gt; - Maintains conditions suitable for complex life forms.                          |<br><br>This table highlights each stage's main features and timeframe, illustrating Earth's atmospheric evolution.</pre></md></sn><sn><md data-rr=\"true\" data-formula=\"true\"><pre>Nitrogen became the dominant gas in Earth's atmosphere due to a combination of factors over billions of years. Here’s how nitrogen levels increased from about 2% in the primordial atmosphere to 78% in the modern atmosphere:<br><br>### 1. **Continuous Volcanic Outgassing**<br>   - During Earth's early stages, volcanic eruptions released large amounts of gases, including nitrogen (N₂), carbon dioxide (CO₂), and water vapor (H₂O).<br>   - As volcanic activity continued over millions of years, nitrogen accumulated gradually in the atmosphere, whereas much of the CO₂ dissolved in oceans or was incorporated into rocks.<br><br>---<br><br>### 2. **Reduction of Carbon Dioxide Levels**<br>   - CO₂, once the dominant gas, was actively reduced by:<br>     - **Ocean Absorption**: As oceans formed, they absorbed significant amounts of CO₂, reducing its concentration in the atmosphere.<br>     - **Carbonate Rock Formation**: Dissolved CO₂ reacted with minerals to form carbonate rocks like limestone, further sequestering CO₂ and freeing up atmospheric space for nitrogen to dominate.<br><br>---<br><br>### 3. **Stable and Unreactive Nature of Nitrogen**<br>   - Unlike oxygen, nitrogen is chemically inert under most conditions, meaning it does not readily react with other elements.<br>   - Nitrogen therefore remained in the atmosphere as other gases (such as hydrogen and CO₂) were removed or reduced over time.<br>   - This stability allowed nitrogen to accumulate as other reactive gases diminished or were sequestered.<br><br>---<br><br>### 4. **Biological Contributions**<br>   - Certain microbes (like nitrogen-fixing bacteria) began converting atmospheric nitrogen into bioavailable forms (like ammonia) that eventually supported plant life and other organisms.<br>   - This cycling, while beneficial for life, did not reduce atmospheric nitrogen levels significantly; instead, it ensured that nitrogen continued to circulate without being permanently removed from the atmosphere.<br><br>---<br><br>### 5. **Formation of the Ozone Layer and Protection of Nitrogen**<br>   - The development of the ozone layer protected atmospheric nitrogen from solar wind stripping, which allowed it to remain abundant in the upper atmosphere.<br><br>---<br><br>Through these processes, nitrogen gradually became the most abundant gas in Earth's atmosphere, reaching today’s level of 78%.</pre></md></sn>","topic_id":348,"last_visited":"2024-10-31T14:44:29.952Z"},{"topic_name":"02.Composition and structure of the atmosphere","topic_html":"<sn><md data-rr=\"true\" data-formula=\"true\"><pre>The composition of Earth’s modern atmosphere is primarily dominated by nitrogen and oxygen, with trace amounts of other gases. Here’s a breakdown of the main components:<br><br>| **Gas**            | **Percentage** |<br>|--------------------|----------------|<br>| **Nitrogen (N₂)**  | 78.08%         |<br>| **Oxygen (O₂)**    | 20.95%         |<br>| **Argon (Ar)**     | 0.93%          |<br>| **Carbon Dioxide (CO₂)** | ~0.04%    |<br>| **Neon (Ne)**      | 0.0018%        |<br>| **Helium (He)**    | 0.0005%        |<br>| **Methane (CH₄)**  | 0.0002%        |<br>| **Krypton (Kr)**   | 0.0001%        |<br>| **Hydrogen (H₂)**  | 0.00005%       |<br>| **Ozone (O₃)**     | Variable, mainly in the stratosphere |<br><br>### Other Variable Gases and Particulates<br>- **Water Vapor (H₂O)**: Ranges from 0-4%, depending on location and climate, significantly influencing weather and climate.<br>- **Pollutants**: Trace amounts of sulfur dioxide (SO₂), nitrogen oxides (NOₓ), and other pollutants are present, especially in industrial areas.<br>- **Aerosols**: Dust, pollen, and other tiny particles vary seasonally and regionally.<br><br>These components make up the atmosphere that supports life, climate, and weather patterns on Earth.</pre></md></sn><sn><h3>Structure of Earth Atmosphere</h3><im>https://cdn-academy.pressidium.com/academy/wp-content/uploads/2021/08/Earths-Atmosphere-with-logo-scaled.jpg</im><md data-rr=\"true\" data-formula=\"true\"><pre>The Earth’s atmosphere is divided into several layers, each with distinct characteristics:<br><br>| **Layer**         | **Altitude Range**          | **Characteristics**                                                                                            |<br>|-------------------|-----------------------------|-----------------------------------------------------------------------------------------------------------------|<br>| **Troposphere**   | 0 - 12 km (average)         | - Closest to Earth’s surface; where weather occurs. &lt;br&gt; - Temperature decreases with altitude. &lt;br&gt; - Contains 75% of atmospheric mass. |<br>| **Stratosphere**  | 12 - 50 km                  | - Contains the ozone layer, which absorbs UV radiation. &lt;br&gt; - Temperature increases with altitude due to ozone absorption. |<br>| **Mesosphere**    | 50 - 85 km                  | - Coldest layer, with temperatures dropping as low as -90°C. &lt;br&gt; - Meteors burn up in this layer.                 |<br>| **Thermosphere**  | 85 - 600 km                 | - Temperature increases sharply with altitude due to solar radiation absorption. &lt;br&gt; - Contains the ionosphere, crucial for radio communication. |<br>| **Exosphere**     | 600 km and beyond           | - Outermost layer, gradually fading into space. &lt;br&gt; - Composed mainly of hydrogen and helium; atoms can escape into space. |<br><br>---<br><br>### Additional Details:<br>- **Ionosphere** (part of the Thermosphere): Contains charged particles that facilitate radio communication by reflecting radio waves back to Earth.<br>- **Ozone Layer** (in the Stratosphere): Plays a vital role in protecting life from harmful ultraviolet (UV) radiation.<br><br>Each layer’s composition, temperature, and characteristics vary significantly, influencing weather, climate, and the behavior of radio waves and satellites.</pre></md></sn>","topic_id":349,"last_visited":"2024-10-31T14:47:08.834Z"}],"chapter_id":127}],"author":{"login":"Nh-emon","id":146737722,"node_id":"U_kgDOCL8KOg","avatar_url":"https://avatars.githubusercontent.com/u/146737722?v=4","gravatar_id":"","url":"https://api.github.com/users/Nh-emon","html_url":"https://github.com/Nh-emon","followers_url":"https://api.github.com/users/Nh-emon/followers","following_url":"https://api.github.com/users/Nh-emon/following{/other_user}","gists_url":"https://api.github.com/users/Nh-emon/gists{/gist_id}","starred_url":"https://api.github.com/users/Nh-emon/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/Nh-emon/subscriptions","organizations_url":"https://api.github.com/users/Nh-emon/orgs","repos_url":"https://api.github.com/users/Nh-emon/repos","events_url":"https://api.github.com/users/Nh-emon/events{/privacy}","received_events_url":"https://api.github.com/users/Nh-emon/received_events","type":"User","site_admin":false,"name":"Emon","company":null,"blog":"","location":null,"email":null,"hireable":null,"bio":null,"twitter_username":null,"public_repos":20,"public_gists":0,"followers":1,"following":1,"created_at":"2023-10-02T13:07:54Z","updated_at":"2024-08-06T16:33:13Z"},"created_on":"2024-10-31T01:33:50.817Z","is_private":false,"folder":"1st Year Final","web_url":"https://qdock.free.nf","last_update_on":"2024-10-31T14:53:14.682Z"}