{"subject_name":"Geology","subject_id":28,"chapters":[{"chapter_name":"03.Petrology","topics":[{"topic_name":"01.Introduction","topic_html":"<sn><h3>Introduction to Petrology<br></h3><im>https://longacresranch.org/wp-content/uploads/2021/12/Deidre-768x512.jpeg</im></sn><sn><h5>Definition<br></h5><p><strong>Petrology</strong> is the branch of geology that deals with the study of rocks, including their composition, texture, and structure.</p><p>It focuses on the classification and analysis of the three major rock types: igneous, sedimentary, and metamorphic. Petrology is essential in understanding the Earth's crust and the processes that form and transform rocks over time</p></sn><sn><h5>Petrogenesis<br></h5><p>The study of the origin of rocks, known as <strong>petrogenesis</strong>, involves investigating how different rocks are formed. This includes understanding the source materials (magma, sediments, or pre-existing rocks), the conditions under which they form (pressure, temperature, and chemical environment), and the geological processes that lead to their transformation over time. Petrogenesis helps scientists trace the history and evolution of the Earth’s crust.</p></sn>","topic_id":289,"last_visited":"2024-10-22T05:11:23.365Z"},{"topic_name":"03.Composition and Classification of Igneous Rock","topic_html":"<sn><h5>Igneous Rock<br></h5><pg>https://drishtiias.com/images/uploads/1665236926_Igneous_Rock_Drishti_IAS_English.jpeg</pg><h5>#Wiki<br></h5><pg>https://en.wikipedia.org/wiki/Igneous_rock</pg></sn>","topic_id":290,"last_visited":"2024-10-22T05:12:33.131Z"}],"chapter_id":118},{"chapter_name":"06.Earthquake and volcanoes","topics":[{"topic_name":"01.Major tectonic features","topic_html":"<sn><h3 class=\"text-center text-info\">major tectonic features of the subcontinent<hr></h3><md data-rr=\"true\"><pre>The Indian subcontinent is geologically diverse and includes several major tectonic features that have resulted from its complex tectonic history. Here are the key tectonic features:<br><br>### 1. **The Himalayan Mountain Range**  <br>   - Formed by the collision of the Indian Plate and the Eurasian Plate about 50 million years ago.<br>   - Includes some of the highest peaks in the world, such as Mount Everest.<br>   - It is still tectonically active, with ongoing uplift and frequent earthquakes.<br><br>### 2. **The Indo-Gangetic Plain**  <br>   - A large alluvial plain between the Himalayas and the Peninsular Plateau.<br>   - Formed by sediment deposition from the rivers originating in the Himalayas and Peninsular India.<br>   - Lies in a tectonic foredeep associated with the Himalayan orogeny.<br><br>### 3. **The Peninsular Plateau**  <br>   - One of the oldest and most stable landmasses of India, part of the Gondwana landmass.<br>   - Composed of ancient crystalline rocks, including granites and gneisses.<br>   - Includes smaller plateaus like the Deccan Plateau, Malwa Plateau, and Chotanagpur Plateau.<br><br>### 4. **The Western Ghats and Eastern Ghats**  <br>   - The **Western Ghats** are faulted escarpments on the western edge of the Deccan Plateau.<br>   - The **Eastern Ghats** are more eroded and dissected, running along the eastern edge of the plateau.<br><br>### 5. **The Deccan Traps**  <br>   - A large volcanic province in west-central India.<br>   - Formed by extensive basaltic lava flows around 65 million years ago during the Cretaceous-Paleogene extinction event.<br><br>### 6. **The Thar Desert**  <br>   - Located in the northwestern part of India, in the state of Rajasthan.<br>   - Associated with the Indian Plate's northward drift and the collision with the Eurasian Plate.<br><br>### 7. **The Indo-Burmese Arc**  <br>   - Located in the northeastern region, where the Indian Plate subducts beneath the Burmese microplate.<br>   - Characterized by folding and faulting, with the presence of the Arakan Yoma Range.<br><br>### 8. **The Andaman and Nicobar Islands**  <br>   - Part of a volcanic island arc formed by the subduction of the Indian Plate beneath the Burma Plate.<br>   - Associated with the tectonic activity of the Sunda Trench.<br><br>### 9. **The Indian Ocean Ridges**  <br>   - The Carlsberg Ridge and the Central Indian Ridge are spreading centers in the Indian Ocean.<br>   - These ridges are evidence of the Indian Plate’s movement and seafloor spreading.<br><br>These features highlight the dynamic geological processes that shaped the Indian subcontinent, making it a region of significant tectonic and geologic interest.</pre></md></sn><sn><h3 class=\"text-center text-info\">The Geo-Enviromental History</h3><md data-rr=\"true\"><pre>The **geo-environmental history** of the Indian subcontinent is a story of its evolution over billions of years, shaped by geological, tectonic, climatic, and biological processes. Here's a detailed overview:<br><br>---<br><br>### **1. Archean Era (4.0–2.5 billion years ago)**  <br>- **Formation of the Peninsular Shield**:  <br>  - The oldest rocks, like the **Dharwar Craton**, formed during this period.<br>  - Composed of granites, gneisses, and greenstone belts, these ancient rocks formed the foundation of the **Peninsular Plateau**.<br>- **Atmospheric Evolution**:  <br>  - Early Earth's atmosphere transitioned to an oxygen-rich environment due to cyanobacteria and photosynthesis.<br><br>---<br><br>### **2. Proterozoic Era (2.5 billion–541 million years ago)**  <br>- **Sedimentation and Supercontinent Assembly**:  <br>  - Extensive sedimentary basins (e.g., Vindhyan and Cuddapah basins) formed.<br>  - India was part of supercontinents like **Columbia**, **Rodinia**, and later **Gondwana**.<br>- **Mineralization**:  <br>  - Large deposits of iron, manganese, and other minerals were formed during this period.<br><br>---<br><br>### **3. Paleozoic Era (541–252 million years ago)**  <br>- **Marine Transgressions and Glaciations**:  <br>  - The Peninsular region saw marine transgressions, leaving fossils in formations like the **Talcher Formation**.<br>  - Evidence of the **Permo-Carboniferous glaciation** is found in the Gondwana sedimentary sequences.<br>- **Tectonic Stability**:  <br>  - The Peninsular Shield remained tectonically stable, forming a passive margin.<br><br>---<br><br>### **4. Mesozoic Era (252–66 million years ago)**  <br>- **Breakup of Gondwana**:  <br>  - India began separating from Gondwana around 150 million years ago, moving northward at a rapid pace.<br>- **Deccan Traps Formation**:  <br>  - Massive volcanic eruptions (~65 million years ago) in western India created the **Deccan Traps**, associated with the extinction of dinosaurs.<br>- **Marine Deposits**:  <br>  - Shallow seas covered parts of India, depositing marine fossils, such as ammonites.<br><br>---<br><br>### **5. Cenozoic Era (66 million years ago–Present)**  <br>#### **Tertiary Period (66–2.6 million years ago):**<br>- **Himalayan Orogeny**:  <br>  - The collision of the **Indian Plate** with the **Eurasian Plate** began ~50 million years ago, creating the **Himalayas** and the **Tibetan Plateau**.<br>- **Sedimentation in the Indo-Gangetic Plain**:  <br>  - Rivers like the Indus and Ganga began depositing vast amounts of sediments, forming the alluvial plains.<br><br>#### **Quaternary Period (2.6 million years ago–Present):**<br>- **Climate Fluctuations**:  <br>  - The subcontinent experienced glacial and interglacial periods during the Pleistocene.<br>  - Climatic changes influenced vegetation, river systems, and human settlements.<br>- **Holocene Epoch**:  <br>  - Around 12,000 years ago, stable climates supported the development of civilizations, like the **Indus Valley Civilization**.<br>  - Human activities began impacting the environment significantly, including deforestation and agriculture.<br><br>---<br><br>### **Key Environmental Transformations**<br>1. **Tectonic Uplift and River Systems**:  <br>   - The Himalayan uplift led to the evolution of major river systems like the **Ganges**, **Brahmaputra**, and **Indus**, shaping the fertile plains.<br>   <br>2. **Desert Formation**:  <br>   - The **Thar Desert** developed due to climatic shifts and the Himalayan rain shadow effect.<br><br>3. **Coastal Evolution**:  <br>   - The Indian coastline changed due to tectonic activity and sea-level fluctuations, influencing ecosystems like mangroves (e.g., Sundarbans).<br><br>---<br><br>### **Present Geo-environmental Context**<br>- **Tectonic Activity**:  <br>  - The Himalayas and northeastern regions remain tectonically active, with frequent earthquakes.<br>- **Climate Change**:  <br>  - Modern climate change is affecting monsoon patterns, glacier retreat in the Himalayas, and sea-level rise.<br>- **Human Impact**:  <br>  - Rapid urbanization, deforestation, and industrialization have caused significant environmental challenges, including soil erosion, water pollution, and loss of biodiversity.<br><br>---<br><br>India’s geo-environmental history reflects a dynamic interplay between geological forces and environmental changes, which continue to shape its landscapes and ecosystems.</pre></md></sn>","topic_id":502,"last_visited":"2024-11-19T12:37:22.084Z"},{"topic_name":"02.Origin of himalayas and gangatic plain","topic_html":"<sn><md data-rr=\"true\"><pre>### **Origin of the Himalayas**<br><br>The **Himalayan mountain range** originated due to tectonic processes over millions of years. Here's the geological history:<br><br>#### **1. Breakup of Gondwana (180–150 million years ago)**  <br>- The **Indian Plate** broke away from the supercontinent Gondwana during the Jurassic period and started moving northward toward the **Eurasian Plate** at a rate of about 15–20 cm per year.<br>- As the plate moved, the **Tethys Sea**, which lay between India and Eurasia, began to close.<br><br>#### **2. Collision of Indian and Eurasian Plates (50–60 million years ago)**  <br>- Around 50 million years ago, the Indian Plate collided with the Eurasian Plate.<br>- Since the Indian Plate was denser and oceanic at its edge, it began to subduct beneath the Eurasian Plate, causing the sediments of the Tethys Sea to compress, fold, and uplift, forming the **Himalayas**.<br><br>#### **3. Continuous Uplift and Growth**  <br>- The Himalayas have undergone multiple phases of uplift due to ongoing tectonic activity.<br>- Even today, the Indian Plate continues to move northward at about 5 cm per year, causing the Himalayas to rise and making the region tectonically active.<br><br>---<br><br>### **Origin of the Gangetic Flood Plains**<br><br>The **Gangetic Plains**, also known as the **Indo-Gangetic Plains**, formed as a result of sediment deposition by rivers originating in the Himalayas. Here’s a step-by-step overview:<br><br>#### **1. Tectonic Foredeep Formation**  <br>- During the Himalayan orogeny, the crust to the south of the rising mountains subsided, forming a **foredeep basin**.<br>- This basin became the site for massive sediment accumulation.<br><br>#### **2. Sediment Deposition (Since ~20 million years ago)**  <br>- Rivers like the **Ganga**, **Brahmaputra**, and their tributaries started carrying vast amounts of sediments eroded from the Himalayas.<br>- These sediments were deposited in the foredeep, gradually building the flat alluvial plains.<br><br>#### **3. Sea-Level Fluctuations and Monsoon Evolution**  <br>- Changes in sea level during the late Cenozoic influenced the sedimentation patterns.<br>- The strengthening of the **South Asian monsoon** (about 8 million years ago) increased erosion in the Himalayas, contributing to greater sediment load in the plains.<br><br>#### **4. Formation of Meandering Rivers and Floodplains**  <br>- The flat topography of the foredeep allowed rivers to spread out, forming a wide network of meandering rivers and seasonal floodplains.<br>- Over time, the plains became highly fertile, supporting diverse ecosystems and human settlements.<br><br>---<br><br>### **Key Features of the Himalayan and Gangetic Systems**<br><br>1. **Himalayas:**<br>   - Composed of three major ranges: **Greater Himalayas (Himadri)**, **Lesser Himalayas (Himachal)**, and **Shivaliks**.<br>   - Serve as the primary source of major river systems, including the **Indus**, **Ganga**, and **Brahmaputra**.<br>   - Act as a climatic barrier, influencing monsoons and creating the rain shadow effect.<br><br>2. **Gangetic Plains:**<br>   - Spanning northern India, these plains are among the most fertile regions in the world.<br>   - Built by sediments from Himalayan rivers, they support extensive agriculture and dense populations.<br>   - Feature diverse landforms like oxbow lakes, levees, and alluvial fans.<br><br>---<br><br>### **Current Dynamics**<br>- **Tectonic Activity:** The Himalayas are still rising due to the continued northward movement of the Indian Plate.<br>- **River Systems:** The plains are shaped by ongoing sedimentation and dynamic river courses, leading to frequent floods and landform changes.<br>- **Climate Impact:** Glacial retreat in the Himalayas due to global warming affects water flow and sediment supply in the Gangetic plains. <br><br>This continuous interaction between the Himalayas and the Gangetic plains is a prime example of active geological processes.</pre></md></sn>","topic_id":503,"last_visited":"2024-11-19T12:40:00.604Z"},{"topic_name":"03.The relation between geographic feature and enviroment","topic_html":"<sn><md data-rr=\"true\"><pre>The **physiographic features** of an area, such as mountains, plains, plateaus, rivers, and coasts, have a profound relationship with the **environment**. These features shape the climate, vegetation, soil, water availability, and biodiversity, ultimately influencing human activities and ecosystems. Here’s an analysis of how they interrelate:<br><br>---<br><br>### **1. Mountains**<br>- **Environmental Influence:**<br>  - **Climate:** Act as climatic barriers, influencing precipitation patterns. For example, the Himalayas block the cold winds from Central Asia and intercept monsoonal rains.<br>  - **Glaciers and Rivers:** Mountains are sources of perennial rivers, fed by glacial melt and rainfall, crucial for water supply and agriculture in plains.<br>  - **Biodiversity:** Support diverse ecosystems, from alpine meadows to coniferous forests, based on altitude and climate zones.<br><br>- **Human and Ecosystem Impact:**<br>  - Influence the development of terrace farming and hydroelectric projects.<br>  - Provide habitats for endemic species, such as the snow leopard in the Himalayas.<br><br>---<br><br>### **2. Plains**<br>- **Environmental Influence:**<br>  - **Soil Fertility:** Plains, like the Indo-Gangetic Plains, are formed by riverine deposits, creating fertile alluvial soils ideal for agriculture.<br>  - **Water Resources:** Availability of surface and groundwater due to river systems promotes irrigation and settlement.<br>  - **Climate:** Plains typically experience moderate rainfall, with regional variations influenced by nearby geographical features.<br><br>- **Human and Ecosystem Impact:**<br>  - Support dense human populations and intensive agriculture.<br>  - Habitat for diverse flora and fauna, particularly in floodplains and wetlands.<br><br>---<br><br>### **3. Plateaus**<br>- **Environmental Influence:**<br>  - **Elevation and Climate:** Plateaus like the Deccan Plateau experience relatively moderate climates compared to surrounding plains.<br>  - **Soil Types:** Predominantly black soil (in volcanic regions) supports crops like cotton and millets.<br>  - **Mineral Resources:** Plateaus are rich in minerals (e.g., Chotanagpur Plateau in India).<br><br>- **Human and Ecosystem Impact:**<br>  - Less favorable for dense human settlement compared to plains but critical for mining and forestry.<br>  - Plateaus support unique ecosystems, like grasslands and scrublands, which are home to specific wildlife.<br><br>---<br><br>### **4. Rivers and Floodplains**<br>- **Environmental Influence:**<br>  - **Hydrological Cycle:** Rivers play a key role in replenishing groundwater, maintaining ecosystems, and supporting agriculture.<br>  - **Floodplains:** Provide nutrient-rich soils due to periodic flooding, boosting agricultural productivity.<br>  - **Wetlands:** Formed along river courses, wetlands act as biodiversity hotspots and carbon sinks.<br><br>- **Human and Ecosystem Impact:**<br>  - Major river systems, like the Ganges and Brahmaputra, support extensive agriculture, water supply, and cultural activities.<br>  - Flooding and pollution pose challenges, impacting both humans and ecosystems.<br><br>---<br><br>### **5. Coastal Regions**<br>- **Environmental Influence:**<br>  - **Climate Moderation:** Coastal areas experience moderate temperatures due to proximity to the sea.<br>  - **Marine Ecosystems:** Support diverse ecosystems like mangroves, coral reefs, and estuaries.<br>  - **Fisheries:** Rich marine resources support livelihoods and food security.<br><br>- **Human and Ecosystem Impact:**<br>  - Dense human settlements and industrial zones often develop along coasts.<br>  - Vulnerable to climate change impacts, such as sea-level rise and cyclones.<br><br>---<br><br>### **6. Deserts**<br>- **Environmental Influence:**<br>  - **Aridity:** Limited precipitation leads to sparse vegetation and harsh climatic conditions.<br>  - **Soil Characteristics:** Sandy and saline soils restrict agricultural potential.<br>  - **Wind Dynamics:** Influence sand dune formation and dust storms.<br><br>- **Human and Ecosystem Impact:**<br>  - Nomadic lifestyles and adaptations like drip irrigation have developed in response to arid conditions.<br>  - Unique desert ecosystems (e.g., the Thar Desert) harbor species like camels and xerophytes.<br><br>---<br><br>### **7. Forested and Hilly Regions**<br>- **Environmental Influence:**<br>  - Forest cover regulates local climates, prevents soil erosion, and supports water cycles.<br>  - Hill slopes influence microclimates, creating biodiversity hotspots.<br><br>- **Human and Ecosystem Impact:**<br>  - Traditional agriculture (e.g., shifting cultivation) and forest-based livelihoods thrive.<br>  - These regions often serve as watersheds for surrounding lowlands.<br><br>---<br><br>### **Interdependence Between Physiography and Environment**<br>1. **Climate Regulation:**<br>   - Physiographic features like mountains, oceans, and plains govern local and regional climates, influencing monsoons, temperature, and wind patterns.<br><br>2. **Water Resources:**<br>   - Rivers originating in mountainous regions sustain plains and agricultural systems.<br><br>3. **Soil Formation:**<br>   - Plateau regions and volcanic activity contribute to soil types like black soil, while river plains provide alluvial soils.<br><br>4. **Biodiversity Distribution:**<br>   - The diversity of physiographic features results in varied habitats, from mangroves in coastal areas to alpine forests in mountains.<br><br>---<br><br>### **Challenges in the Relationship**<br>- **Human Activities:** Deforestation, urbanization, and mining disrupt natural ecosystems and exacerbate environmental issues like soil erosion and biodiversity loss.<br>- **Climate Change:** Rising temperatures and changing precipitation patterns alter the balance between physiographic features and ecosystems, threatening agriculture and water resources.<br><br>---<br><br>### **Conclusion**<br>Physiographic features and the environment are deeply intertwined, with each influencing the other. Protecting these features through sustainable management is essential to maintaining ecological balance and ensuring the well-being of human and natural systems.</pre></md></sn>","topic_id":504,"last_visited":"2024-11-19T12:42:46.913Z"},{"topic_name":"04.World Sedimentary Basin","topic_html":"<sn><md data-rr=\"true\"><pre>### **Major World Sedimentary Basins and Environmental Comparisons**<br><br>Sedimentary basins are regions where sediments have accumulated over millions of years, often associated with tectonic, fluvial, or marine processes. These basins are vital for their natural resources, biodiversity, and environmental roles. Below is a brief discussion of some of the major sedimentary basins:<br><br>---<br><br>### **1. The Amazon Basin (South America)**  <br>- **Formation and Features:**<br>  - Formed by the convergence of the South American and African Plates during the breakup of Gondwana.<br>  - Drained by the **Amazon River**, it is one of the largest sedimentary basins in the world.<br>  - Composed of fluvial and deltaic deposits, with thick layers of sediments eroded from the Andes Mountains.<br><br>- **Environmental Features:**<br>  - Hosts the **Amazon Rainforest**, the world's largest tropical rainforest, a critical carbon sink.<br>  - High biodiversity and a major influence on global oxygen and carbon cycles.<br>  - Threatened by deforestation, soil erosion, and river pollution.<br><br>---<br><br>### **2. The Congo Basin (Central Africa)**  <br>- **Formation and Features:**<br>  - Associated with the ancient Congo Craton and surrounded by tectonic highlands.<br>  - Drained by the **Congo River**, with sediments deposited in swamps and floodplains.<br>  - Dominated by thick laterite soils and peatlands.<br><br>- **Environmental Features:**<br>  - Houses the **Congo Rainforest**, the second-largest tropical rainforest in the world.<br>  - A vital carbon sink and biodiversity hotspot, home to species like gorillas and forest elephants.<br>  - Threatened by logging, mining, and climate change.<br><br>---<br><br>### **3. The Mississippi Basin (North America)**  <br>- **Formation and Features:**<br>  - Covers a large portion of the central United States, formed by the accumulation of sediments from the Appalachian and Rocky Mountains.<br>  - Drained by the **Mississippi River** and its tributaries, with significant alluvial plains and deltaic deposits at its mouth.<br><br>- **Environmental Features:**<br>  - A key agricultural region due to fertile alluvial soils.<br>  - Supports diverse ecosystems, including wetlands and estuaries in the Gulf of Mexico.<br>  - Faces challenges like flooding, soil erosion, and water pollution from agricultural runoff.<br><br>---<br><br>### **4. The Ganges-Brahmaputra Basin (South Asia)**  <br>- **Formation and Features:**<br>  - Formed by sediment deposition from the Himalayas.<br>  - Includes the fertile **Indo-Gangetic Plain** and the **Sundarbans delta**, one of the largest river deltas in the world.<br><br>- **Environmental Features:**<br>  - Supports dense human populations and extensive agriculture.<br>  - Home to unique ecosystems, including the Sundarbans mangroves.<br>  - Vulnerable to climate change, sea-level rise, and river pollution.<br><br>---<br><br>### **5. The Murray-Darling Basin (Australia)**  <br>- **Formation and Features:**<br>  - Formed by tectonic subsidence in southeastern Australia.<br>  - Drained by the **Murray** and **Darling Rivers**, with sediments derived from ancient cratons and surrounding uplands.<br><br>- **Environmental Features:**<br>  - Important for agriculture, especially irrigation-based farming.<br>  - Semi-arid climate, making it highly susceptible to water scarcity.<br>  - Faces challenges like salinization, over-extraction of water, and loss of native ecosystems.<br><br>---<br><br>### **6. The Siberian Basin (Russia)**  <br>- **Formation and Features:**<br>  - A massive sedimentary basin formed during the Mesozoic era.<br>  - Rich in hydrocarbons and covered by taiga forests.<br><br>- **Environmental Features:**<br>  - Sparse population and harsh climatic conditions (cold winters and permafrost).<br>  - Vulnerable to climate change, with melting permafrost releasing stored carbon.<br><br>---<br><br>### **7. The Tigris-Euphrates Basin (Middle East)**  <br>- **Formation and Features:**<br>  - Sediments deposited by the Tigris and Euphrates Rivers, forming one of the world's most ancient sedimentary basins.<br>  - Cradle of early civilizations like Mesopotamia.<br><br>- **Environmental Features:**<br>  - Arid to semi-arid climate, reliant on river water for agriculture and settlements.<br>  - Vulnerable to water scarcity, desertification, and geopolitical tensions over water resources.<br><br>---<br><br>### **Environmental Comparisons**<br><br>| **Basin**             | **Climate**         | **Biodiversity**               | **Major Threats**                              |<br>|------------------------|---------------------|---------------------------------|------------------------------------------------|<br>| **Amazon**            | Tropical            | Extremely high                 | Deforestation, mining, climate change         |<br>| **Congo**             | Tropical            | High                           | Logging, mining, habitat loss                 |<br>| **Mississippi**       | Temperate           | Moderate                       | Agricultural runoff, flooding, urbanization   |<br>| **Ganges-Brahmaputra**| Subtropical         | High (Sundarbans mangroves)    | Sea-level rise, pollution, overpopulation     |<br>| **Murray-Darling**    | Semi-arid to arid   | Low to moderate                | Water scarcity, salinization                  |<br>| **Siberian**          | Subarctic           | Low (taiga)                    | Permafrost melting, resource extraction       |<br>| **Tigris-Euphrates**  | Arid to semi-arid   | Low                            | Water scarcity, desertification, overuse      |<br><br>---<br><br>### **Conclusion**<br>Sedimentary basins are critical for sustaining ecosystems, biodiversity, and human populations. However, they face distinct environmental challenges, often driven by human activities and climate change. Conservation and sustainable management of these basins are essential to preserving their ecological and economic value.</pre></md></sn>","topic_id":505,"last_visited":"2024-11-19T12:46:12.986Z"}],"chapter_id":154}],"author":{"login":"Nh-emon","id":146737722,"node_id":"U_kgDOCL8KOg","avatar_url":"https://avatars.githubusercontent.com/u/146737722?v=4","gravatar_id":"","url":"https://api.github.com/users/Nh-emon","html_url":"https://github.com/Nh-emon","followers_url":"https://api.github.com/users/Nh-emon/followers","following_url":"https://api.github.com/users/Nh-emon/following{/other_user}","gists_url":"https://api.github.com/users/Nh-emon/gists{/gist_id}","starred_url":"https://api.github.com/users/Nh-emon/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/Nh-emon/subscriptions","organizations_url":"https://api.github.com/users/Nh-emon/orgs","repos_url":"https://api.github.com/users/Nh-emon/repos","events_url":"https://api.github.com/users/Nh-emon/events{/privacy}","received_events_url":"https://api.github.com/users/Nh-emon/received_events","type":"User","site_admin":false,"name":"Emon","company":null,"blog":"","location":null,"email":null,"hireable":null,"bio":null,"twitter_username":null,"public_repos":20,"public_gists":0,"followers":1,"following":1,"created_at":"2023-10-02T13:07:54Z","updated_at":"2024-08-06T16:33:13Z"},"created_on":"2024-10-13T10:58:22.065Z","is_private":false,"folder":"1st Year Final","web_url":"https://qdock.free.nf","last_update_on":"2024-11-19T12:46:15.039Z"}