{"subject_name":"Hydrology","subject_id":40,"chapters":[{"chapter_name":"06.Ground Water","topics":[{"topic_name":"01.Ground water and base flow","topic_html":"<sn><h5>#wiki<br></h5><pg>https://en.wikipedia.org/wiki/Groundwater</pg></sn><sn><h3>Ground Water<br></h3><h5>Definition<br></h5><ul><li>Groundwater is the water present beneath Earth's surface in rock and soil pore spaces and in the fractures of rock formations</li><li>A unit of rock or an unconsolidated deposit is called an aquifer when it can yield a usable quantity of water</li><li>The depth at which soil pore spaces or fractures and voids in rock become completely saturated with water is called the water table</li><li>The study of the distribution and movement of groundwater is hydrogeology, also called groundwater hydrology</li></ul></sn><sn><h5>Ground Water Facts :<br></h5><ul><li>About 30 percent of all readily available freshwater in the world is groundwater</li><li>Groundwater is recharged from the surface;it may discharge from the surface naturally at springs and seeps, and can form oases or wetlands</li><li> Groundwater is also often withdrawn for agricultural, municipal, and industrial use by constructing and operating extraction wells</li><li>It can also contain soil moisture, permafrost (frozen soil), immobile water in very low permeability bedrock, and deep geothermal or oil formation water</li><li>It is also water that is flowing within aquifers below the water table</li><li> Sometimes it is useful to make a distinction between groundwater that is closely associated with surface water, and deep groundwater in an aquifer called fossil water</li></ul></sn><sn><h5>Ground Water vs Base Flow<br></h5><tb><pre>| <br><im>https://groundwater.org/wp-content/uploads/2022/08/what-is-groundwater.webp</im> | <br><im>https://rainfalltogroundwater.net/wp-content/uploads/2017/12/Baseflow-USGS-min-1.png</im> |\n| ---  | --- |\n</pre></tb><md data-rr=\"true\"><pre><br>| **Aspect**       | **Groundwater**                                    | **Base Flow**                                  |<br>|------------------|----------------------------------------------------|------------------------------------------------|<br>| **Source**       | Water stored underground in aquifers               | Groundwater seeping into rivers and streams    |<br>| **Role**         | Supplies water to wells, springs, and ecosystems   | Maintains streamflow during dry periods        |<br>| **Occurrence**   | Found in underground reservoirs                    | Observed as part of the continuous flow in surface water bodies  |</pre></md></sn>","topic_id":291,"last_visited":"2024-10-23T02:52:25.048Z"},{"topic_name":"02.Ground water in hydrologic cycle and its occurrence","topic_html":"<sn><im>https://gpm.nasa.gov/education/sites/default/files/article_images/water_cycle.jpg</im></sn><sn><md data-rr=\"true\"><pre>### Groundwater in the Hydrologic Cycle<br><br>In the **hydrologic cycle**, groundwater plays a crucial role in the movement of water between the atmosphere, land, and oceans. The process involves:<br><br>1. **Infiltration**: Precipitation (rain or snow) infiltrates the ground, filling the pore spaces in soil and rock formations, recharging groundwater.<br>2. **Percolation**: Water continues to move downward through the soil and rock layers until it reaches the **water table**, the upper boundary of the groundwater.<br>3. **Storage**: Groundwater accumulates in aquifers—underground reservoirs where it can be stored for long periods.<br>4. **Discharge**: Groundwater eventually discharges into rivers, lakes, and oceans through springs and base flow, or it can be extracted by wells for human use.<br>5. **Evaporation/Transpiration**: Some groundwater re-emerges at the surface and contributes to evaporation or is absorbed by plants, which then release water back into the atmosphere via transpiration.<br><br>### Occurrence of Groundwater<br><br>Groundwater occurs in two primary zones:<br><br>1. **Unsaturated Zone (Vadose Zone)**: <br>   - Located just below the surface.<br>   - Contains both air and water in the pores.<br>   - Water here is not considered groundwater until it percolates deeper.<br><br>2. **Saturated Zone (Phreatic Zone)**:<br>   - All pore spaces are completely filled with water.<br>   - The upper boundary of this zone is the **water table**.<br>   - This is where groundwater is stored in **aquifers**, which can be classified as:<br>     - **Unconfined aquifers**: Open to surface water, allowing for easy recharge.<br>     - **Confined aquifers**: Sandwiched between impermeable layers of rock, trapping water under pressure.<br><br>Groundwater may also surface naturally through **springs** or contribute to stream flow, playing a key part in maintaining rivers during dry periods.</pre></md></sn>","topic_id":292,"last_visited":"2024-10-23T03:54:35.511Z"},{"topic_name":"03.Physical properties and principles of ground water movement","topic_html":"<sn><md data-rr=\"true\" data-formula=\"true\"><pre>### Physical Properties of Groundwater Movement<br><br>1. **Porosity**:<br>   - The percentage of a rock or soil's volume that consists of voids or pores.<br>   - It determines how much water an aquifer can hold.<br>   - **High porosity** materials, like sand or gravel, can store more water.<br><br>2. **Permeability**:<br>   - The ability of a material to transmit water through its pores.<br>   - High permeability allows water to move freely, while low permeability, like clay, restricts movement.<br><br>3. **Hydraulic Conductivity**:<br>   - A measure of how easily water can move through pore spaces or fractures in the aquifer material.<br>   - Expressed as the rate at which water moves through a material per unit area.<br><br>4. **Saturation**:<br>   - Refers to the amount of water within the pore spaces. When all pores are filled with water, the material is fully saturated.<br><br>5. **Hydraulic Gradient**:<br>   - The slope of the water table or potentiometric surface, driving groundwater flow from high to low areas.<br>   - The steeper the gradient, the faster groundwater moves.<br><br>6. **Viscosity**:<br>   - The resistance of water to flow, affected by temperature.<br>   - **Higher viscosity** (thicker water) slows down movement, whereas **lower viscosity** (thinner water) speeds it up.<br><br>7. **Specific Yield**:<br>   - The amount of water that can be extracted from an aquifer after the water table drops, due to gravity.<br><br>8. **Specific Retention**:<br>   - The water that remains in the pore spaces after drainage due to surface tension and adhesion forces.<br><br>---<br><br>### Principles of Groundwater Movement<br><br>1. **Darcy’s Law**:<br>   - Describes the flow of groundwater through porous media.<br>   - The law states that the flow rate (Q) is proportional to the hydraulic gradient (I) and the hydraulic conductivity (K) of the material:<br>   \\[<br>   Q = K \\cdot I \\cdot A<br>   \\]<br>   - Where:<br>     - \\( Q \\) = Flow rate<br>     - \\( K \\) = Hydraulic conductivity<br>     - \\( I \\) = Hydraulic gradient<br>     - \\( A \\) = Cross-sectional area of flow<br><br>2. **Groundwater Flow**:<br>   - Groundwater moves from areas of high hydraulic head (pressure) to areas of low hydraulic head.<br>   - Flow can be horizontal or vertical, depending on geological formations.<br><br>3. **Laminar vs. Turbulent Flow**:<br>   - Groundwater usually flows in a **laminar** manner, meaning water moves in parallel layers without mixing.<br>   - **Turbulent flow** is rare in groundwater due to its typically low velocity but can occur in fractures or highly permeable formations.<br><br>4. **Capillary Action**:<br>   - Water can move upward against gravity through tiny pore spaces due to surface tension, influencing moisture distribution above the water table.<br><br>5. **Recharge and Discharge**:<br>   - **Recharge**: Water from precipitation, streams, or other sources infiltrates and replenishes groundwater.<br>   - **Discharge**: Groundwater emerges at the surface through springs, streams, or wells.<br><br>These principles and properties govern how groundwater moves through the subsurface and contribute to its availability for use.</pre></md></sn>","topic_id":293,"last_visited":"2024-10-23T04:23:01.565Z"},{"topic_name":"04.Recharge of ground water","topic_html":"<sn><md data-rr=\"true\"><pre>### Recharge of Groundwater<br><br>**Groundwater recharge** is the process by which water from the surface replenishes underground aquifers. It plays a critical role in maintaining groundwater levels and sustaining water supplies for ecosystems, agriculture, and human use. Recharge can occur naturally or artificially.<br><br>#### Types of Groundwater Recharge:<br><br>1. **Natural Recharge**:<br>   - **Precipitation**: Rainwater or snowmelt infiltrates the ground and moves through soil and rock to reach aquifers.<br>   - **Stream and River Infiltration**: Water from rivers and streams can seep into the ground and recharge nearby aquifers, especially in areas where the water table is lower than the water bodies.<br>   - **Floods**: Overflowing rivers and streams spread water across floodplains, which allows a significant portion to infiltrate the soil and recharge the groundwater.<br>   - **Lakes and Ponds**: Surface water bodies contribute to recharge through gradual infiltration, especially in areas where they are hydraulically connected to groundwater systems.<br><br>2. **Artificial Recharge**:<br>   - **Recharge Wells**: Human-engineered wells are used to inject surface water or treated wastewater directly into aquifers.<br>   - **Infiltration Basins**: Shallow basins or ponds are constructed to collect stormwater or excess surface water, allowing it to infiltrate the ground and recharge groundwater.<br>   - **Managed Aquifer Recharge (MAR)**: A technique where excess water from rainfall, rivers, or recycled water is intentionally directed into aquifers through different methods (infiltration basins, trenches, or wells) to enhance groundwater storage.<br><br>---<br><br>#### Factors Affecting Groundwater Recharge:<br><br>1. **Soil Permeability**:<br>   - Highly permeable soils, like sandy soils, allow more water to infiltrate and recharge aquifers, while low permeability soils, like clay, reduce recharge rates.<br><br>2. **Vegetation**:<br>   - Plants with deep roots can help water infiltrate deeper into the soil, promoting recharge, while dense vegetation may slow down surface runoff, allowing more time for infiltration.<br><br>3. **Land Use**:<br>   - Urbanization and construction of impermeable surfaces (roads, buildings) reduce recharge by preventing water from penetrating the soil.<br>   - Agricultural practices can either enhance or inhibit recharge, depending on irrigation methods and soil management.<br><br>4. **Climate**:<br>   - Regions with frequent rainfall and a balanced seasonal distribution tend to have higher recharge rates, whereas arid regions with infrequent precipitation have limited recharge.<br><br>---<br><br>#### Importance of Groundwater Recharge:<br>- **Sustains Water Supplies**: Ensures a continuous supply of water for wells, irrigation, and ecosystems, particularly during dry seasons.<br>- **Prevents Overdrafting**: Recharge is essential to prevent excessive groundwater extraction (overdrafting), which can lead to a drop in the water table and land subsidence.<br>- **Improves Water Quality**: As water percolates through soil layers during recharge, it can be filtered, improving the quality of the groundwater by removing contaminants.<br><br>Proper management and enhancement of recharge processes are vital for sustainable groundwater use, especially in areas facing water scarcity.</pre></md></sn>","topic_id":294,"last_visited":"2024-10-23T04:33:54.505Z"}],"chapter_id":119}],"author":{"login":"Nh-emon","id":146737722,"node_id":"U_kgDOCL8KOg","avatar_url":"https://avatars.githubusercontent.com/u/146737722?v=4","gravatar_id":"","url":"https://api.github.com/users/Nh-emon","html_url":"https://github.com/Nh-emon","followers_url":"https://api.github.com/users/Nh-emon/followers","following_url":"https://api.github.com/users/Nh-emon/following{/other_user}","gists_url":"https://api.github.com/users/Nh-emon/gists{/gist_id}","starred_url":"https://api.github.com/users/Nh-emon/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/Nh-emon/subscriptions","organizations_url":"https://api.github.com/users/Nh-emon/orgs","repos_url":"https://api.github.com/users/Nh-emon/repos","events_url":"https://api.github.com/users/Nh-emon/events{/privacy}","received_events_url":"https://api.github.com/users/Nh-emon/received_events","type":"User","site_admin":false,"name":"Emon","company":null,"blog":"","location":null,"email":null,"hireable":null,"bio":null,"twitter_username":null,"public_repos":20,"public_gists":0,"followers":1,"following":1,"created_at":"2023-10-02T13:07:54Z","updated_at":"2024-08-06T16:33:13Z"},"created_on":"2024-10-23T02:39:25.649Z","is_private":false,"folder":"1st Year Final","web_url":"https://qdock.free.nf","last_update_on":"2024-10-23T04:37:47.289Z"}